"""
# Fashion mnist -- sub
# https://tykimos.github.io/2018/09/30/Hello_Fashion_MNIST/
#----------------------------------------------
# Fashion-MNIST는 기존의 MNIST 데이터셋(10개 카테고리의 손으로 쓴 숫자)을 대신해
# 사용할 수 있습니다. 그 이유는 MNIST와 동일한 이미지 크기(28x28)이며 동일한 학습 셋
# (60,000),테스트셋(10,000)으로 나눌수 있기 때문입니다. 따라서 딥러닝의 “hello world”
# 튜토리얼이라고 할 수 있습니다. (난이도가 높아 저수준으로는 예측률이 떨어 짐)
#
#\n\n\n"""
# Fashion-MNIST 데이터셋에는 10개의 카테고리가 있습니다.
# 레이블 설명
# ------
# 0 티셔츠/탑
# 1 바지
# 2 풀오버(스웨터의 일종)
# 3 드레스
# 4 코트
# 5 샌들
# 6 셔츠
# 7 스니커즈
# 8 가방
# 9 앵클 부츠
# print(__doc__)
